package com.example.rehealth.data.prepopulate

import com.example.rehealth.data.models.Medicines
import com.example.rehealth.data.models.SideEffects

object PrepopulateMedicine {

    val addMedicines = writeMedicines()
    val addSideEffects = writeSideEffects()


    private fun writeMedicines(): List<Medicines> {

        return listOf(

            Medicines(
                1,
                "لیتيوم",
                "● در صورت بروز علایم مسمومیت، مصرف دارو را قطع و ضمن تماس فوری با پزشک، به اورژانس مراجعه کنید. \n \n" +
                        "● مصرف در حاملگی ممنوع است. ",
                1,
                ""
            ),
            Medicines(
                2,
                "والپروات سدیم",
                "● در صورت بروز عوارض، به پزشک خود مراجعه نمایید.\n \n" +
                        "● مصرف در حاملگی ممنوع است. ",
                2,
                ""
            ),
            Medicines(
                3,
                "کاربامازپین",
                "● در صورت بروز عوارض شامل بثورات پوستی یا تب، گلو درد، قرمز شدن پوست، خون مردگی و خونریزیهای زود به زود، مصرف دارو را قطع و به پزشک مراجعه کنید. \n \n" +
                        "● مصرف در حاملگی ممنوع است." +
                        "\n" +
                        " \n● در صورت بروز سایر عوارض، به پزشک مراجعه کنید.",
                3,
                ""
            ),
            Medicines(
                4,
                "لاموتریژین",
                "● در صورت بروز هرگونه بثورات پوستی و یا تب و نیز حساسیت و بزرگی غدد لنفاوی، مصرف دارو را قطع و فورا  به پزشک مراجعه نمایید. \n \n" +
                        "● در صورت فراموشی مصرف لاموتریژین برای 4 روز پیاپی، بایستی مانند ابتدای شروع مصرف دارو، دوباره با مقدار کم شروع شود." +
                        "\n \n● در صورت بروز عوارض به پزشک خود مراجعه کنید.",
                4,
                ""
            ),
            Medicines(
                5,
                "پروپرانولول",
                "● مصرف در موارد زیر ممنوع است: \n" +
                        "آسم / دیابت وابسته به انسولین / نارسایی احتقانی قلب / بیماری دریچه ای شدید \n" +
                        "درد سینه پایدار /  پرکاری تیروئید \n \n" +
                        "● در صورت بروز عوارض به پزشک خود مراجعه کنید. ",
                5,
                ""
            ),
            Medicines(
                6,
                "بنزودیازپین ها",
                "● احتیاط در رانندگی و کار با دستگاه های خطرناک \n \n" +
                        "● احتیاط در سالمندان، بیماری کبدی، آپنه خواب، بیماری انسدادی مزمن ریه، سابقه سوء مصرف مواد، اختلالات  شناختی،  بیماری کلیوی ، ضعف بدخیم عضلانی (میاستینی گراوز)، پورفیری" +
                        "\n \n ● عدم افزایش خود سرانه مقدار مصرف دارو  " +
                        "\n \n ● عدم مصرف الکل همزمان با مصرف دارو " +
                        "\n \n ● در  صورت بروز علایم مسمومیت و یا عوارض به پزشک خود مراجعه نمایید. ",
                6,
                "کلونازپام، لورازپام، آلپرازولام"
            ),
            Medicines(
                7,
                "آنتی سایکوتیکها",
                " ● اندازه گیری دوره ای وزن و دور کمر  " +
                        "\n \n ● انجام دوره ای آزمایش خون " +
                        "\n \n ● در صورت بروز عوارض ، به پزشک خود مراجعه نمایید. ",
                7,
                "رسپریدون، الانزاپین، کوئتیاپین، آریپیپرازول"
            )
        )

    }

    private fun writeSideEffects(): List<SideEffects> {

        return listOf(
            SideEffects(
                1,
                "عوارض عصبی خوش خیم",
                " احساس ملال /فقدان خود انگیختگی / طولانی شدن زمان واکنش/نقایص حافظه \n" +
                        "لرزش / تغییر خلاقیت \n",
                1
            ),
            SideEffects(
                2,
                "عوارض عصبی مهم",
                "لرزش خشن / نارسا گویی / بی تعادلی / تحریک پذیری عصبی عضلانی ",
                1
            ),
            SideEffects(
                3,
                "غدد درون ریز",
                "گواتر / کم کاری تیروئید  / پرکاری پاراتیروئید  /بندرت پرکاری تیروئید ",
                1
            ),
            SideEffects(
                4,
                "قلبی عروقی",
                "اختلال  در ضربان قلب",
                1
            ),
            SideEffects(
                5,
                "کلیوی",
                "نقص در تغلیظ ادرار / پرادراری (دیابت بی مزه کلیوی)",
                1
            ),
            SideEffects(
                6,
                "پوستی",
                "آکنه/  ریزش مو/  سوریازیس / بثورات پوستی",
                1
            ),
            SideEffects(
                7,
                "گوارشی",
                "فقدان اشتها/  تهوع/ استفراغ / اسهال",
                1
            ),
            SideEffects(
                8,
                "متفرقه",
                "تغییر سوخت و ساز کربوهیدراتها / افزایش وزن  / احتباس مایع",
                1
            ),

            //ـ والپروات سدیم:
            SideEffects(
                9,
                "عوارض معمول",
                "تحریک گوارشی / تهوع/ رخوتزایی / لرزش/  افزایش وزن/ ریزش مو",
                2
            ),
            SideEffects(
                10,
                "عوارض غیر معمول",
                "استفراغ / اسهال / بی تعادلی / نارساگویی",
                2
            ),
            SideEffects(
                11,
                "عوارض نادر",
                "ضعف عضلات تنفسی و نارسایی تنفسی / کبودی یا خونریزی خود به خود",
                2
            ),

            //ـ کاربامازپین:
            SideEffects(
                12,
                "عوارض معمول",
                "تهوع / استفراغ/ ناراحتی معده / یبوست / اسهال/ بی اشتهایی/ بی تعادلی  / خواب آلودگی",
                3
            ),
            SideEffects(
                13,
                "عوارض  وخیم",
                "اختلالات خونی / هپاتیت / بثورات پوستی",
                3
            ),
            SideEffects(
                14,
                "عوارض غیر معمول",
                "افت سدیم خون و مسمومیت با آب/ تب / بثورات پوستی / پانکراتیت / دو بینی یا نارسایی دید /  اختلال در اجرای تکالیف",
                3
            ),

            //ـ لاموتریژین
            SideEffects(
                15,
                "عوارض معمول",
                "سرگیجه / بی تعادلی / خواب آلودگی / سردرد / دوبینی / تاری دید/ تهوع / تخریب شناختی/ درد پشت یا مفاصل",
                4
            ),
            SideEffects(
                16,
                "عوارض مهم",
                "بثورات پوستی",
                4
            ),

            //ـ پروپرانولول :
            SideEffects(
                17,
                "عوارض معمول",
                "کاهش فشارخون /  کاهش ضربان قلب / نارسایی احتقانی قلب / آسم / تشدید کاهش قند خون در بیماران دیابتی وابسته به انسولین / تهوع / اسهال / درد شکم / اختلال نعوظ/ سستی / خستگی / ملال / بی خوابی / کابوسهای روشن",
                5
            ),
            SideEffects(
                18,
                "عوارض غیر معمول",
                "افسردگی / روان پریشی",
                5
            ),

            //بنزودیازپین ها:
            SideEffects(
                19,
                "عوارض معمول",
                "خواب آلودگی / سرگیجه / بی تعادلی /نقص های شناختی خفیف / فراموشی پیش گستر/ \n" +
                        "افزایش متناقض گونه  در پرخاشگری/ بثورات پوستی / خارش سرتاسری\n",
                6
            ),
            SideEffects(
                20,
                "عوارض مهم",
                "در صورت مصرف همزمان با سایر نخوت زاها بخصوص الکل، خواب آلودگی، مهار گسیختگی واضح و ضعف تنفسی ایجاد می گردد.",
                6
            ),

            //آنتی سایکو تیکهای جدید:
            SideEffects(
                21,
                "عوارض",
                "سردرد / سرگیجه/ تهوع / یبوست/ خواب آلودگی / افزایش وزن و چاقی / افت فشار خون/ افزایش چربی خون / افزایش قند خون  / افزایش پرولاکتین خون و تغییرات عادت ماهیانه/ سفتی و گرفتگی عضلات / کند شدن حرکات / لرزش",
                7
            ),

            )
    }
}